app/views/recipes/edit.html.haml

        %th Delete Ingredient
      -@recipe.ingredients.each do |i|
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 6]]

            <select name = "old[dropdown[ingredient_#{i.id}]]" id="food_select_#{i.id}">
            -Food.all.each do |foo|
---
SELECT "foods".* FROM "foods"