app/views/recipes/new.html.haml

                <select name = "dropdown[newingredient_#{x}]" id="name_select">
                -Food.all.each do |foo|
---
SELECT "foods".* FROM "foods"