app/views/recipes/show.html.haml

            %th Quantity
          -@recipe.ingredients.each do |i|
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 2]]

            %tr
              -@recipe.reviews.each do |rev|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]