app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE (name like '%%')  ORDER BY average_rating DESC, name
---
def index
    @user = current_user
    if params[:query] != nil
      session[:query] = params[:query]
    end
    if params[:cooking_time] != nil
      session[:cooking_time] = params[:cooking_time]
    end
    if params[:recipe_search] != nil
      session[:recipe_search] = params[:recipe_search]
    end
    handle_redirects
    if params[:query] == nil
      @recipes = Recipe.filter(params[:cooking_time]).sorted_by("name").search(params[:recipe_search])

DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
---
def del_ing
  Ingredient.find(params[:ing_id]).destroy
  redirect_to edit_recipe_path(Recipe.find(params[:id]), :additional => params[:additional])

INSERT INTO "ingredients" ("quantity", "food_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", 2], ["food_id", 1], ["recipe_id", 2], ["created_at", "2015-04-02 21:58:13.788757"], ["updated_at", "2015-04-02 21:58:13.788757"]]
INSERT INTO "recipes" ("name", "directions", "cooking_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "new toast"], ["directions", "get a new toaster"], ["cooking_time", 30.0], ["created_at", "2015-03-31 00:03:59.525008"], ["updated_at", "2015-03-31 00:03:59.525008"]]
SELECT "recipes".* FROM "recipes"
---
def create
  ingredient_quantities = params.delete(:ingreds)
  ingredient_names = params.delete(:dropdown)
  r=Recipe.new(create_params)
  r.update_newingredients(ingredient_quantities, ingredient_names)
  if r.save
    flash[:notice] = "New recipe #{r.name} was made"
    redirect_to recipes_path
  else
    flash[:notice] = "The create didn't work :(  "
    flash[:notice] << r.errors.full_messages.join(". ") << "."

DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 2]]
UPDATE "ingredients" SET "name" = ?, "quantity" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["name", "Milk"], ["quantity", 2], ["updated_at", "2015-04-01 17:16:31.031198"], ["id", 7]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "recipes" SET "directions" = ?, "cooking_time" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["directions", "CEREAL FIRST, then milk"], ["cooking_time", 6.0], ["updated_at", "2015-03-31 16:50:40.510080"], ["id", 3]]
INSERT INTO "ingredients" ("quantity", "food_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", 2], ["food_id", 3], ["recipe_id", 1], ["created_at", "2015-04-02 20:27:17.873098"], ["updated_at", "2015-04-02 20:27:17.873098"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 5]]
---
def update
  ingredient_quantities = params.delete(:ingreds)
  ingredient_names = params.delete(:dropdown)
  newingredient_updates = params.delete(:new_ingreds)
  newingredient_names = params.delete(:new_dropdown)
  @recipe = Recipe.find(params[:id])
  @recipe.update_ingredients(ingredient_quantities, ingredient_names)
  @recipe.update_newingredients(newingredient_updates, newingredient_names)
  @recipe.update(update_params)
  if @recipe.save#wont fail until we add validations or force in rspec tests
    flash[:notice] = "You updated #{@recipe.name}"
    redirect_to recipe_path(@recipe) #redirect to the show
  else
    flash[:notice] = "The update failed :(   "
    flash[:notice] << @recipe.errors.full_messages.join(". ") << "."