app/controllers/reviews_controller.rb

   def create
      @recipe = Recipe.find(params[:recipe_id])
      params[:review][:user_id] = @user.id
      @review = Review.new(create_update_params)
      @recipe.update_avg_rating(@review.stars)
      @recipe.reviews << @review
      if @recipe.save
         flash[:notice] = 'Review successfully created!'
         redirect_to(recipe_path(@recipe))
      else
         flash[:notice] = 'Failure to create new review! '
         flash[:notice] << @review.errors.full_messages.join(". ") << "."
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "recipes" SET "average_rating" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["average_rating", 3.0], ["updated_at", "2015-04-12 06:10:08.271760"], ["id", 1]]
INSERT INTO "reviews" ("stars", "comments", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["stars", 1], ["comments", "Fabulous!"], ["recipe_id", 1], ["created_at", "2015-04-11 19:59:27.659227"], ["updated_at", "2015-04-11 19:59:27.659227"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]

   def new
      @recipe = Recipe.find(params[:recipe_id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]